Revit 2026 API

# ISingleServerService Interface

---

The base interface class for all single-server services.

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface ISingleServerService : IExternalService
```
```vb
Public Interface ISingleServerService
	Inherits IExternalService
```
```cpp
public interface class ISingleServerService : IExternalService
```
```fsharp
type ISingleServerService =
    interface
        interface IExternalService
    end
```

The ISingleServerService type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Execute | Implement this method to execute the given server. (Inherited from IExternalService) |
|  | GetDescription | Implement this method to return a description of the service. (Inherited from IExternalService) |
|  | GetName | Implement this method to return the name of the service. (Inherited from IExternalService) |
|  | GetServiceId | Implement this method to return the unique Id of the service. (Inherited from IExternalService) |
|  | GetVendorId | Implement this method to return the vendor Id of the service. (Inherited from IExternalService) |
|  | IsValidServer | Implement this method to check if the given instance represents a valid server of this service. (Inherited from IExternalService) |
|  | OnServersChanged | (Inherited from IExternalService) |
|  | OnServersDisparity | (Inherited from IExternalService) |

Both single-server and multi-server services may have more than one server registered for them. The difference between these two kinds is while there can only be one active server at any given time for a single-sever service, there may be a set of active servers assigned for a multi-server service.

ISingleServerService does not have any specific methods (currently) added to those inherited from the common IExternalService interface.

#### Reference

Autodesk.Revit.DB.ExternalService Namespace